NextFOAM-2606/tutorials/incompressible/lumpedPointMotion/bridge/steady/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $turbulentEpsilon;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    #include    "include/environ"

    inlet
    {
        type          fixedValue;
        value         $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ground
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    "(?i).*bridge.*"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
